# Assignment 2 | 26th February 2021

### Questions 1:

How to import pandas and check the version?

In [1]:
import pandas as pd   # import pandas library
print(pd.__version__)   #Check version of pandas installed on this machine

1.2.2

### Questions 2:

How to create a series from a NumPy array?

In [2]:
# firstly create a numpy array

import numpy as np

arr = np.array([1,2,3,4,5])
print("Numpy array is: \n", arr)

# convert numpy array into  Pandas Series
print()
Series = pd.Series(arr)
print("Pandas Series is: \n")
print(Series)

Numpy array is:
 [1 2 3 4 5]

Pandas Series is:

0    1
1    2
2    3
3    4
4    5
dtype: int64

### Questions 3:

How to convert the index of a series into a column of a dataframe?

In [3]:
# Lets create a Pandas Series first

df = pd.Series([1,2,3,4,5])
df

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [4]:
df1 = pd.DataFrame(df, columns=['number'])  # Converting Series into DataFrame
df1.reset_index(level=0, inplace=True)   # Converting Series to DataFrmae
df1

   index  number
0      0       1
1      1       2
2      2       3
3      3       4
4      4       5

### Questions 4:

Write the code to list all the datasets available in the seaborn library.
Load the 'mpg' dataset
Note: mpg dataset will be read from the seaborn module in the manner sir has already
shown(provided in the materials folder)

In [54]:
import seaborn as sns   # importing seaborn library
print(sns.get_dataset_names())    #printing  predefining datasets

['anagrams', 'anscombe', 'attention', 'brain_networks', 'car_crashes', 'diamonds', 'dots', 'exercise', 'flights', 'fmri', 'gammas', 'geyser', 'iris', 'mpg', 'penguins', 'planets', 'tips', 'titanic']

In [56]:
df = sns.load_dataset('mpg')   # loading mpg dataset
df.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc rebel sst
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford torino

### Questions 5:

Which country origin cars are a part of this dataset?

In [57]:
origin = df['origin'].value_counts()  # Origin values in above dataset

In [58]:
print(origin)

usa       249
japan      79
europe     70
Name: origin, dtype: int64

### Questions 6:

Extract the part of the dataframe which contains cars belonging to ‘usa’

In [59]:
usa_cars = df[df['origin']=='usa']   # Dataset where origin=='usa'

In [60]:
usa_cars.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc rebel sst
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford torino